taro = {
    1: {
        "image": "emperor",
        "taro_text": "<b>Император</b>\n\n"
                     "Аркан предсказывает скорое появление в жизни могущественного покровителя, влиятельного помощника или целеустремленного, сильного человека, который станет опорой.",
    },
    2: {
        "image": "sud",
        "taro_text": "<b>Страшный суд</b>\n\n"
                     "Несмотря на устрашающее название, карта является благоприятным знаком при прямом положении. Она говорит о хороших новостях, скорой свадьбе, позитивных изменениях в жизни, новых перспективах.",
    },
    3: {
        "image": "ace_of_pentacles",
        "taro_text": "<b>Туз Пентаклей</b>\n\n"
                     "Символ изобилия, который может воплотиться в виде поступления финансов, новых перспектив, рождения ребенка, дополнительного источника сил. При обратном положении карта говорит, что вы зациклены на деньгах, много беспокоитесь.",
    },
    4: {
        "image": "ace_of_wands",
        "taro_text": "<b>Туз Жезлов</b>\n\n"
                     "Является символом активности, указывает на то, что вас ждет период больших достижений, карьерный рост, увеличение достатка, развитие своего профессионализма. Обратное положение означает апатию, отсутствие целей, застой в работе.",
    },
    5: {
        "image": "empress",
        "taro_text": "<b>Императрица</b>\n\n"
                     "Этот аркан символизирует счастье в личной жизни – замужество, рождение ребенка, крепкий и стабильный брак, гармонию, взаимопонимание.",
    },
    6: {
        "image": "five_kubkov",
        "taro_text": "<b>Пятерка Кубков</b>\n\n"
                     "Череда мелких неудач, возможны переживания из-за разрыва или ссоры с близким человеком, либо полезные знакомства, появление новых друзей, долгожданное состояние покоя и умиротворения.",
    },
    7: {
        "image": "five_pentacles",
        "taro_text": "<b>Пятерка Пентаклей</b>\n\n"
                     "При прямом положении следует быть осторожным, вероятно, что наступит черная полоса в работе, снизятся доходы. Перевернутый рисунок указывает на то, что у вас появятся единомышленники, вам станет легче противостоять неудачам.",
    },
    8: {
        "image": "king_of_wands",
        "taro_text": "<b>Король Жезлов</b>\n\n"
                     "Символ богатства, власти, могущества, благополучия. Перевернутый рисунок следует трактовать как жестокость, деспотизм, конфликты, ссоры. Карта говорит о том, что вы сможете пойти на многое ради достижения своих целей.",
    },
    9: {
        "image": "knight_of_pentacles",
        "taro_text": "<b>Рыцарь Пентаклей</b>\n\n"
                     "Вы сможете повысить свой профессиональный уровень или материальный статус, в любовных делах произойдут благоприятные изменения. При перевернутом образе нужно опасаться обмана, предательства, измены.",
    },
    10: {
        "image": "lovers",
        "taro_text": "<b>Влюбленные</b>\n\n"
                     "Карта указывает на правильный выбор партнера, истинную любовь, крепкий союз, удачный брак, а также на хорошие отношения и взаимопонимание с окружающими людьми.",
    },
    11: {
        "image": "magician",
        "taro_text": "<b>Маг</b>\n\n"
                     "Аркан символизирует большие возможности, достижение целей, реализацию планов, стабильность в будущем, повышение уверенности в себе.",
    },
    12: {
        "image": "moon",
        "taro_text": "Луна\n\n"
                     "Влияние Луны в Таро всегда следует воспринимать в негативном свете.\n"
                     "Ее появление в раскладе можно расценивать по-разному: неопределенность, нестабильность, ощущение тревоги, проблемы со здоровьем, обман, происки недоброжелателей и прочие опасности.",
    },
    13: {
        "image": "nine_zhezls",
        "taro_text": "<b>Девятка Жезлов</b>\n\n"
                     "Карта указывает на то, что вам придется проявить активность, например, ускориться, чтобы быстрее закончить свое дело, вступить в соперничество, повысить физические нагрузки. Либо говорит, что вы столкнетесь с препятствиями.",
    },
    14: {
        "image": "page_of_wands",
        "taro_text": "<b>Паж Жезлов</b>\n\n"
                     "Вас ждут радостные известия, возможно, даже вселенского значения, к примеру, вы наконец-то добьетесь желаемого, сможете реализовать амбиции. Аркан в перевернутом положении говорит, что вы находитесь в центре интриг и сплетен.",
    },
    15: {
        "image": "povesheniy",
        "taro_text": "<b>Повешенный</b>\n\n"
                     "У аркана есть несколько интерпретаций – самоотдача, осознанный отказ от материальных благ, смирение, духовное развитие, переход на новый жизненный уровень.",
    },
    16: {
        "image": "queen_of_swords",
        "taro_text": "<b>Королева Мечей</b>\n\n"
                     "Знакомство или общение с влиятельной дамой, которая будет к вам благосклонна, либо неприятности со стороны женщины, например, интриги, сплетни, подтасовка фактов.",
    },
    17: {
        "image": "seven_pentacles",
        "taro_text": "<b>Семерка Пентаклей</b>\n\n"
                     "Знак того, что вы идете по верному пути, вас ожидает успех, все препятствия будут преодолены. Изображение наоборот – это предупреждение о том, что вы рискуете проиграть в большом деле, лишиться своего состояния, стать банкротом.",
    },
    18: {
        "image": "seven_zhezls",
        "taro_text": "<b>Семерка Жезлов</b>\n\n"
                     "Ваши конкуренты от вас не отстают, поэтому нужно проявить решительность, смелость, не бояться вступать в борьбу. Второе значение аркана – вы растеряны, ощущаете усталость, грусть, нежелание растрачивать ресурсы.",
    },
    19: {
        "image": "six_pentacles",
        "taro_text": "<b>Шестерка Пентаклей</b>\n\n"
                     "Символ достатка, процветания, благополучия, возможен карьерный рост, поощрение, новый способ заработка. Второе значение – высокая вероятность быть обманутым, связаться с мошенниками, потерять крупную сумму.",
    },
    20: {
        "image": "six_swords",
        "taro_text": "<b>Шестерка Мечей</b>\n\n"
                     "Символ того, что все трудности остались позади, знак благоприятных изменений в ближайшем будущем либо указание на то, что вы медлите, затягиваете с важным вопросом или столкнетесь с неприятностями в пути.",
    },
    21: {
        "image": "six_zhezls",
        "taro_text": "<b>Шестерка Жезлов</b>\n\n"
                     "Символизирует уверенного в себе, честолюбивого, амбициозного человека, лидера. Может означать либо стремление к первенству либо, наоборот, отсутствие веры в себя, если выпадает перевернутая карта.",
    },
    22: {
        "image": "three_of_pentacles",
        "taro_text": "<b>Тройка Пентаклей</b>\n\n"
                     "Рост материального уровня, новые источники заработка, обретение деловых контактов, которые приведут к стабильному благосостоянию, либо недопонимания, конфликты с партнерами, недоверие с их стороны, риск быть обманутым.",
    },
    23: {
        "image": "two_kubkov",
        "taro_text": "<b>Двойка Кубков</b>\n\n"
                     "Карта указывает на то, что в ближайшем будущем вас ждет любовь, страсть, улучшатся отношения с партнером или случится бурный роман либо при перевернутом рисунке вас настигнет ненужная мимолетная связь или расставание.",
    },
    24: {
        "image": "two_pentacles",
        "taro_text": "<b>Двойка Пентаклей</b>\n\n"
                     "Позитивные перемены в жизни, хорошие новости, возможность получать удовольствие в делах или отношениях либо потеря контроля над ситуацией, нестабильность в финансовой сфере, ссоры с близкими или коллегами из-за разных взглядов.",
    },
    25: {
        "image": "verovnaya_zhrica",
        "taro_text": "<b>Верховная жрица</b>\n\n"
                     "По карте можно говорить о сильной интуиции, умении раскрывать ложь, осторожности в общении с людьми, внутренней уверенности и способности преодолевать препятствия.",
    },
    26: {
        "image": "wheel_fortune",
        "taro_text": "<b>Колесо Фортуны</b>\n\n"
                     "Карта предсказывает удачу, везение, победы, успеха в делах, радостных событий, новых знакомств, долгожданных перемен к лучшему.",
    },

}